#!usr/bin/python
#-*- coding:utf-8 _*-

from WindPy import w

def getWsd(security):
    w.start()
    data = w.wsd(security, "open,close,low,high,amt", 'LQ1')
    w.stop()
    return data

def formatResult(data):
    result = []
    for time in data.Times:
        subresult = []
        subresult.append(time.strftime('%Y-%m-%d'))
        for item in data.Data:
            subresult.append(item[data.Times.index(time)])
        result.append(subresult)
    return result

def getMessage(code):
    codeDic={0:"查询成功",-40520001:"未知错误",-40520002:"内部错误",-40520003:"系统错误",-40520004:"登录失败",-40520005:"无权限",-40520006:"用户取消",-40520007:"无数据", -40520008:"超时错误",
             -40521010:"超时错误",-40520009:"本地WBOX错误",-40520010:"需要内容不存在",-40520011:"需要服务器不存在",-40520012:"引用不存在",-40520013:"其他地方登录错误",-40520014:"未登录使用 WIM 工具，故无法登录",
             -40520015:"连续登录失败次数过多",-40521001:"IO 操作错误",-40521002:"后台服务器不可用",-40521003:"网络连接失败",-40521004:"请求发送失败",-40521005:"数据接收失败",-40521006:"网络错误",
             -40521007:"服务器拒绝请求",-40521008:"错误的应答",-40521009:"数据解码失败",-40521010:"网络超时",-40521011:"频繁访问",-40522001:"无合法会话",-40522002:"非法数据服务",-40522003:"非法请求",-40522004:"万得代码语法错误",
             -40522005:"不支持的万得代码",-40522006:"指标语法错误",-40522007:"不支持的指标",-40522008:"指标参数语法错误",-40522009:"不支持的指标参数",-40522010:"日期与时间语法错误",-40522011:"不支持的日期与时间",-40522012:"不支持的请求参数",
             -40522013:"数组下标越界",-40522014:"重复的 WQID",-40522015:"请求无相应权限",-40522016:"不支持的数据类型",-40522017:"数据提取量超限"}
    return codeDic[code]